app/controllers/comments_controller.rb

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @comment = Comment.find(:id)

INSERT INTO "comments" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2015-12-14 18:14:40.663683"], ["updated_at", "2015-12-14 18:14:40.663683"]]
---
  def create
    @comment = Comment.new(comment_params)

    respond_to do |format|
      if @comment.save

DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 5]]
---
  def destroy
    if @comment.user_id==5
      @comment.destroy