app/controllers/items_controller.rb

  def index
    #@items = Item.find_by_user_id(Session[user_id])
    @items = Item.all
---
SELECT "items".* FROM "items"

  def show
    @items = Item.find(params[:id])
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @item = Item.new(item_params) #Remember to add Session[user_id]
    respond_to do |format|
      if @item.save
---
INSERT INTO "items" ("name", "weight", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "mac"], ["weight", 123], ["description", "apple laptop"], ["user_id", 1], ["created_at", "2015-12-16 05:38:02.259326"], ["updated_at", "2015-12-16 05:38:02.259326"]]

  def update
    @item = Item.find(params[:id])
    respond_to do |format|
      if @item.update(item_params)
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "items" SET "name" = ?, "weight" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["name", "dell2"], ["weight", 500], ["updated_at", "2015-12-14 18:49:24.004151"], ["id", 1]]