app/controllers/lendings_controller.rb

  def index
    #@lendings = Lending.find_by_user_id(Session[user_id])
    @lendings = Lending.all
---
SELECT "lendings".* FROM "lendings"

  def show
    @lendings = Lending.find(params[:id])
---
SELECT  "lendings".* FROM "lendings" WHERE "lendings"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @lending = Lending.new(lending_params)

    respond_to do |format|
      if @lending.save
---
INSERT INTO "lendings" ("item_id", "user_id", "lendee", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["item_id", 5], ["user_id", 2], ["lendee", 3], ["created_at", "2015-12-14 20:10:27.338188"], ["updated_at", "2015-12-14 20:10:27.338188"]]

  def update
    respond_to do |format|
      if @lending.update(lending_params)
---
UPDATE "lendings" SET "item_id" = ?, "user_id" = ?, "lendee" = ?, "updated_at" = ? WHERE "lendings"."id" = ?  [["item_id", 6], ["user_id", 2], ["lendee", 3], ["updated_at", "2015-12-14 20:11:53.280603"], ["id", 2]]

  def destroy
    @lending.destroy
---
DELETE FROM "lendings" WHERE "lendings"."id" = ?  [["id", 2]]

    def set_lending
      @lending = Lending.find(params[:id])
---
SELECT  "lendings".* FROM "lendings" WHERE "lendings"."id" = ? LIMIT 1  [["id", 2]]