app/controllers/pending_requests_controller.rb

INSERT INTO "pending_requests" ("user_id", "item_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["item_id", 2], ["created_at", "2015-12-16 06:32:36.548906"], ["updated_at", "2015-12-16 06:32:36.548906"]]
---
  def create
    @pending_request = PendingRequest.new(pending_request_params)

    respond_to do |format|
      if @pending_request.save

SELECT  "pending_requests".* FROM "pending_requests" WHERE "pending_requests"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_pending_request
      @pending_request = PendingRequest.find(params[:id])