app/controllers/posts_controller.rb

  def index
    @posts = Post.find_by_user_id(Session[:user_id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = ? LIMIT 1  [["user_id", 1]]

  def show
    @post = Post.find(:id)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("user_id", "post", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["post", "hello its meeeeeee"], ["created_at", "2015-12-16 05:43:16.421036"], ["updated_at", "2015-12-16 05:43:16.421036"]]