app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2015-12-16 06:18:52.849938"], ["updated_at", "2015-12-16 06:18:52.849938"]]
---
  def create
    @user = User.new(params[:id])

    respond_to do |format|
      if @user.save